src/Catalogs/ПолитикиУчетаСерий/ПолитикиУчетаСерий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПолитикиУчетаСерий</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПолитики</name>
    <type>
      <types>EnumRef.ТипыПолитикУказанияСерий</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДляИзделийПриВыполненииМаршрутныхЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДляМатериаловПриВыполненииМаршрутныхЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПоФактуОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриВозвратеНаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриВыпускеВПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриДвиженииМатериалов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриДвиженииПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеВРозницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеКлиенту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеКомплектовДляРазборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеКомплектующихДляСборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеНаВнутренниеНужды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеПоВозвратуПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеПоПеремещению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтраженииИзлишков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтраженииЗатратНаПроизводство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтраженииНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПеремещенииМеждуПомещениями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПересчетеТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПланированииОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПланированииОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПолученииМатериалов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеКомплектующихПослеРазборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеОтПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеПоВозвратуОтКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеПоПеремещению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеПоПрочемуОприходованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеПродукцииИзПроизводства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеСобранныхКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетСерийПоFEFO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьОстаткиСерий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриВозвратеНепринятыхПолучателемТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляСклада</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПроизводства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыПолитикУказанияСерий/ТипыПолитикУказанияСерий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПолитикУказанияСерий</name>
  <enumValues>
    <name>СправочноеУказаниеСерий</name>
  </enumValues>
  <enumValues>
    <name>АвторасчетПоFEFOОстатковСерий</name>
  </enumValues>
  <enumValues>
    <name>УправлениеПоFEFOОстаткамиСерий</name>
  </enumValues>
  <enumValues>
    <name>УправлениеОстаткамиСерий</name>
  </enumValues>
  <enumValues>
    <name>УчетСебестоимостиПоСериям</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПолитикиУчетаСерий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Возвращает имена блокруемых реквизитов для механизма блокирования реквизитов БСП
//	Возвращаемое значание:
//		Массив - имена блокируемых реквизитов
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ТипПолитики");
	
	Результат.Добавить("УказыватьПриОтгрузке");
	Результат.Добавить("УказыватьПриОтгрузкеВРозницу");
	Результат.Добавить("УказыватьПриОтгрузкеКлиенту");
	Результат.Добавить("УказыватьПриОтгрузкеКомплектовДляРазборки");
	Результат.Добавить("УказыватьПриОтгрузкеКомплектующихДляСборки");
	Результат.Добавить("УказыватьПриОтгрузкеНаВнутренниеНужды");
	Результат.Добавить("УказыватьПриОтгрузкеПоВозвратуПоставщику");
	Результат.Добавить("УказыватьПриОтгрузкеПоПеремещению");
	
	Результат.Добавить("УказыватьПриПриемке");
	Результат.Добавить("УказыватьПриПриемкеКомплектующихПослеРазборки");
	Результат.Добавить("УказыватьПриПриемкеОтПоставщика");
	Результат.Добавить("УказыватьПриПриемкеПоВозвратуОтКлиента");
	Результат.Добавить("УказыватьПриВозвратеНепринятыхПолучателемТоваров");
	Результат.Добавить("УказыватьПриПриемкеПоПеремещению");
	Результат.Добавить("УказыватьПриПриемкеПоПрочемуОприходованию");
	Результат.Добавить("УказыватьПриПриемкеСобранныхКомплектов");
	
	Результат.Добавить("УказыватьПриОтраженииИзлишков");
	Результат.Добавить("УказыватьПриОтраженииНедостач");
	Результат.Добавить("УказыватьПриПеремещенииМеждуПомещениями");

	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	НоменклатураВызовСервера.ПолитикиУчетаСерийОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы


// Обработчик обновления BAS УТ 3.2.1
//	Взводит новые флаги:
//	- "Указывать серии при отражении недостач" - если взведен флаг "Указывать серии при отражении излишков, недостач и порчи" (старое название);
//	- "Указывать серии при приемке непринятых получателем товаров", если был взведен флаг "Указывать серии при отгрузке"
Процедура ВзвестиФлагиИзлишкиНедостачиВозвратНепринятых() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПолитикиУчетаСерий.УказыватьПриПриемке КАК УказыватьПриПриемке,
	|	ПолитикиУчетаСерий.УказыватьПриОтгрузке КАК УказыватьПриОтгрузке,
	|	ПолитикиУчетаСерий.ТипПолитики КАК ТипПолитики,
	|	ПолитикиУчетаСерий.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|ГДЕ
	|		НЕ ПолитикиУчетаСерий.УказыватьПриОтраженииНедостач
	|		И НЕ ПолитикиУчетаСерий.ТипПолитики
	|				= ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий)
	|		И НЕ ПолитикиУчетаСерий.ТипПолитики
	|				= ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий)
	|	ИЛИ
	|		НЕ ПолитикиУчетаСерий.УказыватьПриВозвратеНепринятыхПолучателемТоваров
	|		И (НЕ ПолитикиУчетаСерий.ТипПолитики
	|				= ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий)
	|			ИЛИ ПолитикиУчетаСерий.УказыватьПриОтгрузке И ПолитикиУчетаСерий.УказыватьПриПриемке)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Не Выборка.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий
			И Не Выборка.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий Тогда
			СправочникОбъект.УказыватьПриОтраженииНедостач = Истина;
		КонецЕсли;
		Если Не Выборка.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий
			Или Выборка.УказыватьПриОтгрузке И Выборка.УказыватьПриПриемке Тогда
			СправочникОбъект.УказыватьПриВозвратеНепринятыхПолучателемТоваров = Истина;
		КонецЕсли;
        
        ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
		
	КонецЦикла;

КонецПроцедуры

// Обработчик обновления BAS УТ 3.2.1
// Взводит флаг: ДляСклада
Процедура ЗаполнитьРеквизитДляСклада() Экспорт    

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолитикиУчетаСерий.Ссылка
	|ИЗ
	|	Справочник.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|ГДЕ
	|	НЕ ПолитикиУчетаСерий.ДляСклада
	|	И (ПолитикиУчетаСерий.УказыватьПриПриемке
	|			ИЛИ ПолитикиУчетаСерий.УказыватьПриПересчетеТоваров
	|			ИЛИ ПолитикиУчетаСерий.УказыватьПриОтгрузке
	|			ИЛИ ПолитикиУчетаСерий.УказыватьПриОтраженииИзлишков
	|			ИЛИ ПолитикиУчетаСерий.УказыватьПриОтраженииНедостач
	|			ИЛИ ПолитикиУчетаСерий.УказыватьПриПеремещенииМеждуПомещениями)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
 		
        СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
 			
        СправочникОбъект.ДляСклада = СправочникОбъект.УказыватьПриПриемке
                                        ИЛИ СправочникОбъект.УказыватьПриПересчетеТоваров
                                        ИЛИ СправочникОбъект.УказыватьПриОтгрузке
                                        ИЛИ СправочникОбъект.УказыватьПриОтраженииИзлишков
                                        ИЛИ СправочникОбъект.УказыватьПриОтраженииНедостач
                                        ИЛИ СправочникОбъект.УказыватьПриПеремещенииМеждуПомещениями;
											
 		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
 			
 	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#КонецЕсли
